modm-io/modm/src/xpcc/architecture/platform/cortex_m3/stm32/adc/adc_2.hpp
		public:
			/**
			 * Initialize and enable the A/D converter.
			 *
			 * Enables the ADC clock and switches on the ADC. The ADC clock
			 * prescaler will be set as well.
			 * 
			 * The ADC clock must not exceed 14 MHz. Default is a prescaler
			 * of 8 which gives a 9 Mhz ADC clock at 72 MHz APB2 clock.
			 * 
			 * @param prescaler
			 * 		The prescaler specifies by which factor the 
			 * 		APB2 clock (72 MHz) will be divided.
			 */
			static inline void
			initialize(Prescaler prescaler=PRESCALER_8)
			{
				// Initialize ADC
				RCC->APB2ENR |= RCC_APB2ENR_ADC2EN;	// start ADC Clock
				ADC2->CR2 |= ADC_CR2_ADON;			// switch on ADC
				setPrescaler(prescaler);
			}
			
			// TODO
			//static void
			//calibrate();
			
			/** 
			 * Select the frequency of the clock to the ADC. The clock is common
			 * for all the ADCs (ADC1, ADC2, ADC3) and all channels. 
			 * 
			 * @pre The ADC clock must be started and the ADC switched on with 
			 * 	initialize()
			 * 
			 * @param prescaler
			 * 		The prescaler specifies by which factor the system clock
			 * 		will be divided.
			 */
			static inline void
			setPrescaler(const Prescaler prescaler)
			{
#if defined(STM32F2XX) || defined(STM32F4XX)
				ADC->CCR &= ~(0b11 << 17);				// Clear prescaler
				ADC->CCR |= prescaler << 17;		// set prescaler
#elif defined(STM32F10X)
				RCC->CFGR &= ~(0b11 << 14);			// Clear prescaler
				RCC->CFGR |= prescaler << 14;		// set prescaler
#endif
			}
			
#if defined(TEMPERATURE_REFVOLTAGE_AVIALABLE) || defined(__DOXYGEN__)
			/** Switch on temperature- and V_REF measurement. */
			static inline void
			enableTemperatureRefVMeasurement(void)
			{
#if defined(STM32F2XX) || defined(STM32F4XX)
				ADC->CCR |= ADC_CCR_TSVREFE;
#elif defined(STM32F10X)
				ADC2->CR2 |= ADC_CR2_TSVREFE;
#endif
			}

			/** Switch on temperature- and V_REF measurement. */
			static inline void
			disableTemperatureRefVMeasurement(void)
			{
#if defined(STM32F2XX) || defined(STM32F4XX)
				ADC->CCR &= ~ADC_CCR_TSVREFE;
#elif defined(STM32F10X)
				ADC2->CR2 &= ~ADC_CR2_TSVREFE;
#endif
			}
#endif // TEMPERATURE_REFVOLTAGE_AVIALABLE

			/**
			 * Change the presentation of the ADC conversion result.
			 *
			 * @param enable
			 * 		Set to \c true to left adjust the result. 
			 *		Otherwise, the result is right adjusted.
			 * 
			 * @pre The ADC clock must be started and the ADC switched on with 
			 * 		initialize()
			 */
			static inline void
			setLeftAdjustResult(const bool enable)
			{
				if (enable) {
					ADC2->CR2 |= ADC_CR2_ALIGN;
				}
				else {
					ADC2->CR2 &= ~ADC_CR2_ALIGN;
				}
			}

			/**
			 * Analog channel selection.
			 * 
			 * This not for scan mode. The number of channels will be set to 1, 
			 * the channel selected and the corresponding pin will be set to 
			 * analog input.
			 * If the the channel is modified during a conversion, the current
			 * conversion is reset and a new start pulse is sent to the ADC to 
			 * convert the new chosen channnel / group of channels.
			 * 
			 * 
			 * @param channel		The channel which shall be read.
			 * @param sampleTime	The sample time to sample the input voltage.
			 * 
			 * @pre The ADC clock must be started and the ADC switched on with 
			 * 		initialize()
			 */
			static void
			setChannel(const Channels channel, const SampleTime sampleTime=static_cast<SampleTime>(0b000));

			/**
			 * Enables free running mode
			 *
			 * The ADC will continously start conversions and provide the most
			 * recent result in the ADC register.
			 * 
			 * @pre The ADC clock must be started and the ADC switched on with 
			 * 		initialize()
			 */
			static inline void
			enableFreeRunningMode(void)
			{
				ADC2->CR2 |= ADC_CR2_CONT;	// set to continuous mode
			}

			/**
			 * Disables free running mode
			 *
			 * The ADC will do only one sample and stop. The result will be in 
			 * the ADC register.
			 * 
			 * @pre The ADC clock must be started and the ADC switched on with 
			 * 		initialize()
			 */
			static inline void
			disableFreeRunningMode(void)
			{
				ADC2->CR2 &= ~ADC_CR2_CONT;		// set to single mode
			}

			/**
			 * Returns if the specified interrupt flag is set.
			 * 
			 * @return \c true if the flag is set
			 * @pre The ADC clock must be started and the ADC switched on with 
			 * 	initialize()
			 * @param flag The interrupt flag, which shall be checked.
			 */
			static inline bool
			isInterruptFlagSet(const Interrupt flag)
			{
				return ADC2->SR & flag;
			}

			/**
			 * Clears the specified interrupt flag.
			 *
			 * @param flag
			 * 		The interrupt flag, which shall be cleared.
			 *
			 * @pre The ADC clock must be started and the ADC switched on with 
			 * 		initialize().
			 */
			static inline void
			resetInterruptFlags(const Interrupt flag)
			{
				ADC2->SR &= ~flag;
			}

			/**
			 * Disables the ADC Conversion Complete Interrupt.
			 */
			static void
			disableInterrupt(const Interrupt interrupt);

			/**
			 * Enables the ADC Conversion Complete Interrupt.
			 *
			 * You could catch the interrupt using this example function:
			 * \li for STM32F4XX: \code extern "C" void ADC_IRQHandler() \endcode
			 * \li for STM32F10X: \code extern "C" void ADC1_2_IRQHandler() \endcode
			 * 
			 * @pre The ADC clock must be started and the ADC switched on with 
			 * 	initialize()
			 * 
			 * @param priority Priority to set
			 * @param interrupt The interrupt, which shall be enabled. See 
			 * 	Interrupt for available interrupts.
			 * 
			 * @note ADC1 and ADC2 interrupts are mapped onto the same interrupt
			 * 	vector. ADC3 interrupts are mapped onto a separate interrupt 
			 * 	vector.
			 */
			static void
			enableInterrupt(const Interrupt interrupt, const uint32_t priority);
			
			/**
			 * Turns off the ADC and its clock.
			 */
			static inline void
			shutdownAdc(void)
			{
				ADC2->CR2 &= ~(ADC_CR2_ADON);		// switch off ADC
				RCC->APB2ENR &= ~RCC_APB2ENR_ADC2EN; // stop ADC Clock
			}

			/**
			 * Start a new conversion or continuous conversions.
			 * 
			 * @pre A ADC channel must be selected with setChannel(). When using
			 * 	a STM32F10x a delay of at least t_STAB after initialize() must 
			 * 	be waited! 
			 * 
			 * @post The result can be fetched with getValue()
			 * @attention When using a STM32F10x, the application should allow a delay of t_STAB between
			 * 	power up and start of conversion. Refer to Reference Manual 
			 * 	(RM0008) ADC_CR2_ADON. 
			 */
			static inline void
			startConversion(void)
			{
#if defined(STM32F2XX) || defined(STM32F4XX)
				resetInterruptFlags(static_cast<Interrupt>(
						END_OF_CONVERSION_REGULAR | END_OF_CONVERSION_INJECTED |
						ANALOG_WATCHDOG | OVERRUN));
#elif defined(STM32F10X)
				resetInterruptFlags(static_cast<Interrupt>(
						END_OF_CONVERSION_REGULAR | END_OF_CONVERSION_INJECTED |
						ANALOG_WATCHDOG));
				
				// select the SWSTART event used to trigger the start of
				// conversion of a regular group
				ADC2->CR2 |= ADC_CR2_EXTTRIG | ADC_CR2_EXTSEL_0 |
						ADC_CR2_EXTSEL_1 | ADC_CR2_EXTSEL_2;
#endif
				// starts single conversion for the regular group
				ADC2->CR2 |= ADC_CR2_SWSTART;
			}

			/** 
			 * @return If the conversion is finished.
			 * @pre A conversion should have been stared with startConversion()
			 */
			static inline bool
			isConversionFinished(void)
			{
				return (ADC2->SR & ADC_SR_EOC);
			}

			/**
			 * @return The most recent 16bit result of the ADC conversion.
			 * @pre A conversion should have been stared with startConversion()
			 * 
			 * To have a blocking GET you might do it this way:
			 * @code
				while(!isConversionFinished()) 
				{
					// Waiting for conversion
				}
				@endcode
			 */
			static inline uint16_t
			getValue(void)
			{
				return ADC2->DR;
			}
		};

