modm-io/modm/src/xpcc/architecture/platform/cortex_m3/stm32/adc/adc_2.hpp
		private:
			// ----------------------------------------------------------------------------
			// TODO: move this to some shared header for all cortex m3 platforms
			// Re-implemented here to save some code space. As all arguments in the calls
			// below are constant the compiler is able to calculate everything at
			// compile time.
			static ALWAYS_INLINE void
			nvicEnableInterrupt(const IRQn_Type IRQn)
			{
				NVIC->ISER[(static_cast<uint32_t>(IRQn) >> 5)] =
											(1 << ((uint32_t)(IRQn) & 0x1F));
			}

			static ALWAYS_INLINE void
			nvicDisableInterrupt(IRQn_Type IRQn)
			{
				NVIC_DisableIRQ(IRQn);
			}

		public:
			static void
			enableInterruptVector(const uint32_t priority,
													const bool enable = true)
			{
				const IRQn_Type INTERRUPT_VECTOR = ADC1_2_IRQn;
				if (enable) {
					NVIC_SetPriority(INTERRUPT_VECTOR, priority);
					nvicEnableInterrupt(INTERRUPT_VECTOR);
				} else {
					NVIC_DisableIRQ(INTERRUPT_VECTOR);
				}
			}

			static inline void
			enableInterrupt(const Interrupt interrupt)
			{
				ADC2->IER |= static_cast<uint32_t>(interrupt);
			}

			static inline void
			disableInterrupt(const Interrupt interrupt)
			{
				ADC2->IER &= ~static_cast<uint32_t>(interrupt);
			}

			static inline InterruptFlag
			getInterruptFlags()
			{
				return static_cast<InterruptFlag>(ADC2->ISR);
			}

			static inline void
			resetInterruptFlags(const InterruptFlag flags)
			{
				// Flags are cleared by writing a one to the flag position.
				// Writing a zero is ignored.
				ADC2->ISR = static_cast<uint32_t>(flags);
			}
		};

		ENUM_CLASS_FLAG(Adc2::InterruptFlag)
#else
	#  error "Unknown CPU Type. Please define STM32F10X_.., \
											STM32F2XX, STM32F3XX or STM32F4XX"
#endif
	}

}

#endif	// XPCC_STM32__ADC2_HPP